# IsFlowBlocked Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPAnalyticalNode..::..IsFlowBlocked Property
MEPAnalyticalNode Class See Also
---
Is the flow blocked at this analytical node?
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool IsFlowBlocked { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsFlowBlocked As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsFlowBlocked {
	bool get ();
}
```

# See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace